def get_mask_card_number(pan_input: str) -> str:
    '''
    Функция принимает на вход номер карты и возвращает ее маску.
    Номер карты замаскирован и отображается в формате XXXX XX** **** XXXX,
    где X — это цифра номера. То есть видны первые 6 цифр и последние 4 цифры,
    остальные символы отображаются звездочками, номер разбит по блокам по 4 цифры,
    разделенным пробелами.
    Пример работы функции при валидном вводе:
    входной аргумент = '7000792289606361'
    возвращает = '7000 79** **** 6361'
    Примечание:
    pan_input - PAN = Primary Account Number (номер карты)
    '''
    return pan_input[0:4] + ' ' + pan_input[4:6] + '** ****' + pan_input[-4:]


def get_mask_account(account_input: str) -> str:
    '''
    Функция принимает на вход номер счета и возвращает его маску.
    Номер счета замаскирован и отображается в формате **XXXX, где X — это цифра номера.
    То есть видны только последние 4 цифры номера, а перед ними — две звездочки.
    Пример работы функции при валидном вводе:
    входной аргумент = '73654108430135874305'
    возвращает = '**4305'
    '''
    return '**' + account_input[-4:]
